/*
 * @Company: Inossem
 * @Author: Jiang Xiao
 * @Email: xiao.jiang@inossem.com
 * @Date: 2020-03-07 10:37:57
 * @LastEditors: xiao.jiang
 * @LastEditTime: 2020-04-13 15:16:03
 * @Description:
 */
export default {

    title: '智能仓储系统',
    /**
     * @description token在Cookie中存储的天数，默认1天
     */
    cookieExpires: 1,
    useI18n: true,
    /**
     * @description 默认打开的首页的路由name值，默认为home
     */
    homeName: 'home',
    /**
     * @description 需要加载的插件
     */
    plugin: {},

    // 请求地址会根据开发环境自动切换 [已修改为全局变量前往public/index页修改]

    imgFormat: ['jpg', 'jpeg', 'png', 'gif', 'svg', 'bmp', 'webp', 'ico'],
    fileMaxSize: 5120,

    PRINTERIP: 'http://',
    PRINTERPORT: '',
    PRINTERTYPE: '',

    PATTERN: {
        ID_CARD: /^[1-9][0-9]{5}([1][9][0-9]{2}|[2][0][0|1][0-9])([0][1-9]|[1][0|1|2])([0][1-9]|[1|2][0-9]|[3][0|1])[0-9]{3}([0-9]|[X])$/,
        VEHICLENUMBER: /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-Z0-9]{4}[A-Z0-9挂学警港澳]{1}$/,
        EMAIL: /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/,
        PHONE: /^((\(\d{3}\))|(\d{3}\-))?(\(0\d{2,3}\)|0\d{2,3}-)?[1-9]\d{6,7}$/,
        PHONE_PER: /^((13[0-9])|(14[5,7])|(15[0-3,5-9])|(17[0,3,5-8])|(18[0-9])|166|198|199|(147))\d{8}$/,
        MOBILE: /^((\d{11})|^((\d{7,8})|(\d{4}|\d{3})-(\d{7,8})|(\d{4}|\d{3})-(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1})|(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1}))$)$/,
        URL: /^(http|https):\/\/[A-Za-z0-9]+\.[A-Za-z0-9]+[\/=\?%\-&_~`@[\]\':+!]*([^<>\"\"]){0,6000}$/,
        URL_PATH: /^[\/\.A-Za-z0-9\u0391-\uFFE5]+[\/=\?%\-&_~`@[\]\':+!]*([^<>\"\"]){0,6000}$/,
        ENGLISH: /^[A-Za-z]+$/, // 英文
        DEBIT_CARD: /^(?:[1-9]{1})(?:\d{15}|\d{18})$/, // 银行卡号（16或19位）
        LN: /^[A-Za-z0-9]+$/, // 只能输入数字和字母
        TIME: /^(0?[0-9]|1[0-9]|2[0-3]):(0?[0-9]|[1-5][0-9])$/, // 时间格式 小时 + 分钟, ps: 23:59
        LETTER_NUMBER: /(?!^[0-9]*$)(?!^[a-zA-Z]*$)^([a-zA-Z0-9]{2,})$/, // 必须为数字和字母组合，ps: i6
        LETTER_NUMBER_04: /^[a-zA-Z0-9]{0,4}$/, // 0-4位必须为数字和字母组合，ps: 123p
        LETTER_NUMBER_03: /^[a-zA-Z0-9]{0,3}$/, // 0-3位必须为数字和字母组合，ps: 12p
        CHINESE: /^[\u0391-\uFFE5\s]+$/, // 中文
        TAX: /^[A-Z0-9]{15}$|^[A-Z0-9]{17}$|^[A-Z0-9]{18}$|^[A-Z0-9]{20}$/, // 税号
        PORT: /^([0-9]|[1-9]\d{1}|[1-9]\d{2}|[1-9]\d{3}|[1-5]\d{4}|6[0-4]\d{3}|65[0-4]\d{2}|655[0-2]\d|6553[0-5])$/, // 端口号
        DOUBLE: /^[0-9][1-9]|[1-9]0$/, // 两位数（01-99）
        UNSAFE: /^(([A-Z]*|[a-z]*|\d*|[-_\~!@#\$%\^&\*\.\(\)\[\]\{\}<>\?\\\/\'\"]*)|.{0,5})$|\s/, // 非法字符
        IP: /^(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])$/
    }
}
